from datetime import datetime, timedelta
from random import randrange, randint, choice

#Всякие штуки из которых генерируются чаты и данные пользователей и агентов

m_names =[
    "Василий", "Геннадий", "Виталий", "Борис", "Владислав",  "Виктор", "Артур", "Марк"
]
m_family_names = [
    "Федосеев", "Алексеев", "Новиков", "Егоров", "Одинцов", "Богданов", "Логинов", "Свельев", "Поляков", "Дементьев", "Давыдов", "Лобанов", "Кожевников", "Смирнов"
]
m_surnames =[
    "Максимович", "Васильевич", "Ярославович", "Демидов", "Глебович", "Артемович", "Робертович", "Романович", "Александрович", "Платонович", 
    "Ильич", "Кириллович", "Всеволодович", "Иванович"
]

f_names =[
    "Ангелина", "Елизавета", "Василиса", "Жанна", "Елена", "Алиса",
]
f_family_names =[
    "Федосеева", "Алексеева", "Новикова", "Егорова", "Одинцова", "Богданова", "Логинова", "Свельева", "Полякова", "Дементьева", "Давыдова", "Лобанова", "Кожевникова", "Смирнова"
]
f_surnames =[
    "Максимовна", "Васильевна", "Ярославовна", "Демидовна", "Глебовна", "Артемовна", "Робертовна", "Романовна", "Александровна", "Платоновна", 
    "Ильина", "Кирилловна", "Всеволодовна", "Ивановна"
]

def generate_random_name(gender):
    if gender == "m":
        name = choice(m_names)
        family_name = choice(m_family_names)
        surname = choice(m_surnames)
    else:
        name = choice(f_names)
        family_name = choice(f_family_names)
        surname = choice(f_surnames)
    return name, family_name, surname

cities = [
    "Москва", "Санкт-Петербург", "Хабаровск", "Владивосток", "Краснодар", "Комсомольск-на-Амуре", "Ростов-на-Дону", "Уфа", "Казань", "Красноярск", "Екатеринбург", 
    "Калининград", "Нижний Новгород", "Новосибирск"
]



def generate_random_date():
    start_date = datetime(1940, 1,1)
    end_date = datetime(2008, 12,31)
    time_between_dates = end_date-start_date
    days_pool = time_between_dates.days
    random_number_of_days = randrange(days_pool)
    random_date = start_date + timedelta(days=random_number_of_days)
    return random_date.date()


jod_titles = ['L1','L2']
    

def generate_length_of_service():
    return randint(0,1825)


questions = [
    "Где курьер?", "Где мой заказ?", "Почему опаздываете?", "Приборы не привезли :(", "Забыли положить картошку", "Напиток пролился", "Хочу отменить заказ", "Как оформить заказ ко времени?",
    "Почему доставка такая дорогая?", "Заказ из лавки не привезли", "Заказ приехал холодным"
]
answers = [
    "Извините, что так получилось :(", "Курьеру уже в пути", "Курьер спешит к вам", "К сожалению, вы не указали приборы", "Подскажите, пожалуйста, куда нужно доставить заказ?",
    "Мы всегда рады помочь!", "Всего доброго", "Перевожу вас в Лавку", "Промокоды можно найти в приложении", "Стоимость доставки формируется автоматически"
]